zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_IEPRC_PCI.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_ieprc_pci.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_ieprc_pci
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_ieprc_pci_H_)  /* Check if memory map has not been already included */
#define S32K566_ieprc_pci_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- ieprc_pci Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ieprc_pci_Peripheral_Access_Layer ieprc_pci Peripheral Access Layer
 * @{
 */

/** ieprc_pci - Register Layout Typedef */
typedef struct ieprc_pci_Struct {
  __I  uint32_t PCI_CFH_DID_VID;                   /**< PCI device ID and vendor ID register, offset: 0x0 */
  __IO uint16_t PCI_CFH_CMD;                       /**< PCI command register, offset: 0x4 */
  __I  uint16_t PCI_CFH_STAT;                      /**< PCI status register, offset: 0x6 */
  __I  uint32_t PCI_CFH_REVID_CLASSCODE;           /**< PCI revision ID and classcode register, offset: 0x8 */
  __IO uint8_t PCI_CFH_CL_SIZE;                    /**< PCI cache line size register, offset: 0xC */
  uint8_t RESERVED_0[1];
  __I  uint8_t PCI_CFH_HDR_TYPE;                   /**< PCI header type register, offset: 0xE */
  uint8_t RESERVED_1[29];
  __I  uint16_t PCI_CFH_SUBSYS_VID;                /**< PCI subsystem vendor ID register, offset: 0x2C */
  __I  uint16_t PCI_CFH_SUBSYS_ID;                 /**< PCI subsystem ID register, offset: 0x2E */
  uint8_t RESERVED_2[4];
  __I  uint8_t PCI_CFH_CAP_PTR;                    /**< PCI capabilities pointer register, offset: 0x34 */
  uint8_t RESERVED_3[7];
  __IO uint8_t PCI_CFH_INT_LINE;                   /**< PCI interrupt line register, offset: 0x3C */
  __I  uint8_t PCI_CFH_INT_PIN;                    /**< PCI interrupt pin register, offset: 0x3D */
  uint8_t RESERVED_4[2];
  __I  uint16_t PCI_CFC_PCIE_CAP_LIST;             /**< PCI PCIe capabilities list register, offset: 0x40 */
  __I  uint16_t PCI_CFC_PCIE_CAP;                  /**< PCI PCIe capabilities register, offset: 0x42 */
  __I  uint32_t PCI_CFC_PCIE_DEV_CAP;              /**< PCI PCIe device capabilities register, offset: 0x44 */
  uint8_t RESERVED_5[2];
  __I  uint16_t PCI_CFC_PCIE_DEV_STAT;             /**< PCI PCIe device status register, offset: 0x4A */
  uint8_t RESERVED_6[16];
  __IO uint16_t PCI_CFC_PCIE_ROOT_CTL;             /**< PCI PCIe root control register, offset: 0x5C */
  uint8_t RESERVED_7[2];
  __IO uint32_t PCI_CFC_PCIE_ROOT_STAT;            /**< PCI PCIe root status register, offset: 0x60 */
  uint8_t RESERVED_8[28];
  __I  uint16_t PCI_CFC_PCIPM_CAP_LIST;            /**< PCI PCI-PM capabilities list register, offset: 0x80 */
  __I  uint16_t PCI_CFC_PCIPM_CAP;                 /**< PCI PCI-PM capabilities register, offset: 0x82 */
  __IO uint16_t PCI_CFC_PCIPM_CTL_STAT;            /**< PCI PCI-PM control and status register, offset: 0x84 */
  uint8_t RESERVED_9[1];
  __I  uint8_t PCI_CFC_PCIPM_DATA;                 /**< PCI PCI-PM capabilities data register, offset: 0x87 */
  uint8_t RESERVED_10[120];
  __I  uint32_t PCIE_CFC_AER_EXT_CAP_HDR;          /**< PCIe AER extended capability header, offset: 0x100 */
  uint8_t RESERVED_11[40];
  __IO uint32_t PCIE_CFC_AER_ROOT_ERR_CMD;         /**< PCIe AER root error command register, offset: 0x12C */
  __IO uint32_t PCIE_CFC_AER_ROOT_ERR_STAT;        /**< PCIe AER root error status register, offset: 0x130 */
  __I  uint32_t PCIE_CFC_AER_ERR_SRC_ID;           /**< PCIe AER error source identification register, offset: 0x134 */
  __I  uint32_t PCIE_CFC_RCEC_EPA_EXT_CAP_HDR;     /**< PCIe RCEC Endpoint association extended capability header, offset: 0x138 */
  __I  uint32_t PCIE_CFC_RCEC_EPA_BITMAP;          /**< PCIe RCEC Endpoint association bitmap register, offset: 0x13C */
} ieprc_pci_Type, *ieprc_pci_MemMapPtr;

/** Number of instances of the ieprc_pci module. */
#define ieprc_pci_INSTANCE_COUNT                 (2u)

/* ieprc_pci - Peripheral instance base addresses */
/** Peripheral IEPRC_1__IEPRC_B0_EC_F0_PCI_HDR_TYPE0 base address */
#define IP_IEPRC_1__IEPRC_B0_EC_F0_PCI_HDR_TYPE0_BASE (0x6D408000u)
/** Peripheral IEPRC_1__IEPRC_B0_EC_F0_PCI_HDR_TYPE0 base pointer */
#define IP_IEPRC_1__IEPRC_B0_EC_F0_PCI_HDR_TYPE0 ((ieprc_pci_Type *)IP_IEPRC_1__IEPRC_B0_EC_F0_PCI_HDR_TYPE0_BASE)
/** Peripheral IEPRC_1__IEPRC_B1_EC_F0_PCI_HDR_TYPE0 base address */
#define IP_IEPRC_1__IEPRC_B1_EC_F0_PCI_HDR_TYPE0_BASE (0x6D508000u)
/** Peripheral IEPRC_1__IEPRC_B1_EC_F0_PCI_HDR_TYPE0 base pointer */
#define IP_IEPRC_1__IEPRC_B1_EC_F0_PCI_HDR_TYPE0 ((ieprc_pci_Type *)IP_IEPRC_1__IEPRC_B1_EC_F0_PCI_HDR_TYPE0_BASE)
/** Array initializer of ieprc_pci peripheral base addresses */
#define IP_ieprc_pci_BASE_ADDRS                  { IP_IEPRC_1__IEPRC_B0_EC_F0_PCI_HDR_TYPE0_BASE, IP_IEPRC_1__IEPRC_B1_EC_F0_PCI_HDR_TYPE0_BASE }
/** Array initializer of ieprc_pci peripheral base pointers */
#define IP_ieprc_pci_BASE_PTRS                   { IP_IEPRC_1__IEPRC_B0_EC_F0_PCI_HDR_TYPE0, IP_IEPRC_1__IEPRC_B1_EC_F0_PCI_HDR_TYPE0 }

/* ----------------------------------------------------------------------------
   -- ieprc_pci Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ieprc_pci_Register_Masks ieprc_pci Register Masks
 * @{
 */

/*! @name PCI_CFH_DID_VID - PCI device ID and vendor ID register */
/*! @{ */

#define ieprc_pci_PCI_CFH_DID_VID_VENDOR_ID_MASK (0xFFFFU)
#define ieprc_pci_PCI_CFH_DID_VID_VENDOR_ID_SHIFT (0U)
#define ieprc_pci_PCI_CFH_DID_VID_VENDOR_ID_WIDTH (16U)
#define ieprc_pci_PCI_CFH_DID_VID_VENDOR_ID(x)   (((uint32_t)(((uint32_t)(x)) << ieprc_pci_PCI_CFH_DID_VID_VENDOR_ID_SHIFT)) & ieprc_pci_PCI_CFH_DID_VID_VENDOR_ID_MASK)

#define ieprc_pci_PCI_CFH_DID_VID_DEVICE_ID_MASK (0xFFFF0000U)
#define ieprc_pci_PCI_CFH_DID_VID_DEVICE_ID_SHIFT (16U)
#define ieprc_pci_PCI_CFH_DID_VID_DEVICE_ID_WIDTH (16U)
#define ieprc_pci_PCI_CFH_DID_VID_DEVICE_ID(x)   (((uint32_t)(((uint32_t)(x)) << ieprc_pci_PCI_CFH_DID_VID_DEVICE_ID_SHIFT)) & ieprc_pci_PCI_CFH_DID_VID_DEVICE_ID_MASK)
/*! @} */

/*! @name PCI_CFH_CMD - PCI command register */
/*! @{ */

#define ieprc_pci_PCI_CFH_CMD_INTR_DISABLE_MASK  (0x400U)
#define ieprc_pci_PCI_CFH_CMD_INTR_DISABLE_SHIFT (10U)
#define ieprc_pci_PCI_CFH_CMD_INTR_DISABLE_WIDTH (1U)
#define ieprc_pci_PCI_CFH_CMD_INTR_DISABLE(x)    (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFH_CMD_INTR_DISABLE_SHIFT)) & ieprc_pci_PCI_CFH_CMD_INTR_DISABLE_MASK)
/*! @} */

/*! @name PCI_CFH_STAT - PCI status register */
/*! @{ */

#define ieprc_pci_PCI_CFH_STAT_INTR_STATUS_MASK  (0x8U)
#define ieprc_pci_PCI_CFH_STAT_INTR_STATUS_SHIFT (3U)
#define ieprc_pci_PCI_CFH_STAT_INTR_STATUS_WIDTH (1U)
#define ieprc_pci_PCI_CFH_STAT_INTR_STATUS(x)    (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFH_STAT_INTR_STATUS_SHIFT)) & ieprc_pci_PCI_CFH_STAT_INTR_STATUS_MASK)

#define ieprc_pci_PCI_CFH_STAT_CAP_LIST_MASK     (0x10U)
#define ieprc_pci_PCI_CFH_STAT_CAP_LIST_SHIFT    (4U)
#define ieprc_pci_PCI_CFH_STAT_CAP_LIST_WIDTH    (1U)
#define ieprc_pci_PCI_CFH_STAT_CAP_LIST(x)       (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFH_STAT_CAP_LIST_SHIFT)) & ieprc_pci_PCI_CFH_STAT_CAP_LIST_MASK)
/*! @} */

/*! @name PCI_CFH_REVID_CLASSCODE - PCI revision ID and classcode register */
/*! @{ */

#define ieprc_pci_PCI_CFH_REVID_CLASSCODE_REV_ID_MASK (0xFFU)
#define ieprc_pci_PCI_CFH_REVID_CLASSCODE_REV_ID_SHIFT (0U)
#define ieprc_pci_PCI_CFH_REVID_CLASSCODE_REV_ID_WIDTH (8U)
#define ieprc_pci_PCI_CFH_REVID_CLASSCODE_REV_ID(x) (((uint32_t)(((uint32_t)(x)) << ieprc_pci_PCI_CFH_REVID_CLASSCODE_REV_ID_SHIFT)) & ieprc_pci_PCI_CFH_REVID_CLASSCODE_REV_ID_MASK)

#define ieprc_pci_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK (0xFFFFFF00U)
#define ieprc_pci_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT (8U)
#define ieprc_pci_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_WIDTH (24U)
#define ieprc_pci_PCI_CFH_REVID_CLASSCODE_CLASS_CODE(x) (((uint32_t)(((uint32_t)(x)) << ieprc_pci_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT)) & ieprc_pci_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK)
/*! @} */

