zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_IEPRC_PCI.h
/*! @name PCI_CFH_CL_SIZE - PCI cache line size register */
/*! @{ */

#define ieprc_pci_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK (0xFFU)
#define ieprc_pci_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT (0U)
#define ieprc_pci_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_WIDTH (8U)
#define ieprc_pci_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE(x) (((uint8_t)(((uint8_t)(x)) << ieprc_pci_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT)) & ieprc_pci_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK)
/*! @} */

/*! @name PCI_CFH_HDR_TYPE - PCI header type register */
/*! @{ */

#define ieprc_pci_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK (0x7FU)
#define ieprc_pci_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT (0U)
#define ieprc_pci_PCI_CFH_HDR_TYPE_HDR_TYPE_WIDTH (7U)
#define ieprc_pci_PCI_CFH_HDR_TYPE_HDR_TYPE(x)   (((uint8_t)(((uint8_t)(x)) << ieprc_pci_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT)) & ieprc_pci_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK)

#define ieprc_pci_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK (0x80U)
#define ieprc_pci_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT (7U)
#define ieprc_pci_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_WIDTH (1U)
#define ieprc_pci_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV(x) (((uint8_t)(((uint8_t)(x)) << ieprc_pci_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT)) & ieprc_pci_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK)
/*! @} */

/*! @name PCI_CFH_SUBSYS_VID - PCI subsystem vendor ID register */
/*! @{ */

#define ieprc_pci_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_MASK (0xFFFFU)
#define ieprc_pci_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_SHIFT (0U)
#define ieprc_pci_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_WIDTH (16U)
#define ieprc_pci_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID(x) (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_SHIFT)) & ieprc_pci_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_MASK)
/*! @} */

/*! @name PCI_CFH_SUBSYS_ID - PCI subsystem ID register */
/*! @{ */

#define ieprc_pci_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_MASK (0xFFFFU)
#define ieprc_pci_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_SHIFT (0U)
#define ieprc_pci_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_WIDTH (16U)
#define ieprc_pci_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID(x) (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_SHIFT)) & ieprc_pci_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_MASK)
/*! @} */

/*! @name PCI_CFH_CAP_PTR - PCI capabilities pointer register */
/*! @{ */

#define ieprc_pci_PCI_CFH_CAP_PTR_CAP_PTR_MASK   (0xFFU)
#define ieprc_pci_PCI_CFH_CAP_PTR_CAP_PTR_SHIFT  (0U)
#define ieprc_pci_PCI_CFH_CAP_PTR_CAP_PTR_WIDTH  (8U)
#define ieprc_pci_PCI_CFH_CAP_PTR_CAP_PTR(x)     (((uint8_t)(((uint8_t)(x)) << ieprc_pci_PCI_CFH_CAP_PTR_CAP_PTR_SHIFT)) & ieprc_pci_PCI_CFH_CAP_PTR_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFH_INT_LINE - PCI interrupt line register */
/*! @{ */

#define ieprc_pci_PCI_CFH_INT_LINE_INT_LINE_MASK (0xFFU)
#define ieprc_pci_PCI_CFH_INT_LINE_INT_LINE_SHIFT (0U)
#define ieprc_pci_PCI_CFH_INT_LINE_INT_LINE_WIDTH (8U)
#define ieprc_pci_PCI_CFH_INT_LINE_INT_LINE(x)   (((uint8_t)(((uint8_t)(x)) << ieprc_pci_PCI_CFH_INT_LINE_INT_LINE_SHIFT)) & ieprc_pci_PCI_CFH_INT_LINE_INT_LINE_MASK)
/*! @} */

/*! @name PCI_CFH_INT_PIN - PCI interrupt pin register */
/*! @{ */

#define ieprc_pci_PCI_CFH_INT_PIN_INT_PIN_MASK   (0xFFU)
#define ieprc_pci_PCI_CFH_INT_PIN_INT_PIN_SHIFT  (0U)
#define ieprc_pci_PCI_CFH_INT_PIN_INT_PIN_WIDTH  (8U)
#define ieprc_pci_PCI_CFH_INT_PIN_INT_PIN(x)     (((uint8_t)(((uint8_t)(x)) << ieprc_pci_PCI_CFH_INT_PIN_INT_PIN_SHIFT)) & ieprc_pci_PCI_CFH_INT_PIN_INT_PIN_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_CAP_LIST - PCI PCIe capabilities list register */
/*! @{ */

#define ieprc_pci_PCI_CFC_PCIE_CAP_LIST_CAP_ID_MASK (0xFFU)
#define ieprc_pci_PCI_CFC_PCIE_CAP_LIST_CAP_ID_SHIFT (0U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_LIST_CAP_ID_WIDTH (8U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_LIST_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFC_PCIE_CAP_LIST_CAP_ID_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_CAP_LIST_CAP_ID_MASK)

#define ieprc_pci_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_MASK (0xFF00U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_SHIFT (8U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_WIDTH (8U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR(x) (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_CAP - PCI PCIe capabilities register */
/*! @{ */

#define ieprc_pci_PCI_CFC_PCIE_CAP_CAP_VER_MASK  (0xFU)
#define ieprc_pci_PCI_CFC_PCIE_CAP_CAP_VER_SHIFT (0U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_CAP_VER_WIDTH (4U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_CAP_VER(x)    (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFC_PCIE_CAP_CAP_VER_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_CAP_CAP_VER_MASK)

#define ieprc_pci_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_MASK (0xF0U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_SHIFT (4U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_WIDTH (4U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE(x) (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_MASK)

#define ieprc_pci_PCI_CFC_PCIE_CAP_INT_MSG_NUM_MASK (0x3E00U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_INT_MSG_NUM_SHIFT (9U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_INT_MSG_NUM_WIDTH (5U)
#define ieprc_pci_PCI_CFC_PCIE_CAP_INT_MSG_NUM(x) (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFC_PCIE_CAP_INT_MSG_NUM_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_CAP_INT_MSG_NUM_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_DEV_CAP - PCI PCIe device capabilities register */
/*! @{ */

#define ieprc_pci_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_MASK (0x10000000U)
#define ieprc_pci_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_SHIFT (28U)
#define ieprc_pci_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_WIDTH (1U)
#define ieprc_pci_PCI_CFC_PCIE_DEV_CAP_FLR_CAP(x) (((uint32_t)(((uint32_t)(x)) << ieprc_pci_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_DEV_STAT - PCI PCIe device status register */
/*! @{ */

#define ieprc_pci_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_MASK (0x20U)
#define ieprc_pci_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_SHIFT (5U)
#define ieprc_pci_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_WIDTH (1U)
#define ieprc_pci_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND(x) (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_ROOT_CTL - PCI PCIe root control register */
/*! @{ */

#define ieprc_pci_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN_MASK (0x8U)
#define ieprc_pci_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN_SHIFT (3U)
#define ieprc_pci_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN_WIDTH (1U)
#define ieprc_pci_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN(x) (((uint16_t)(((uint16_t)(x)) << ieprc_pci_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_ROOT_STAT - PCI PCIe root status register */
/*! @{ */

#define ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID_MASK (0xFFFFU)
#define ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID_SHIFT (0U)
#define ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID_WIDTH (16U)
#define ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID(x) (((uint32_t)(((uint32_t)(x)) << ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID_MASK)

#define ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS_MASK (0x10000U)
#define ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS_SHIFT (16U)
#define ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS_WIDTH (1U)
#define ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS(x) (((uint32_t)(((uint32_t)(x)) << ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS_SHIFT)) & ieprc_pci_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS_MASK)

